In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import sklearn
from sklearn.model_selection import train_test_split
import warnings
warnings.filterwarnings("ignore")

In [4]:
%cd /content/drive/MyDrive

/content/drive/MyDrive

In [5]:
adult_data=pd.read_csv("adult_dataset.csv")

In [6]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education.num   32561 non-null  int64
 5   marital.status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital.gain    32561 non-null  int64
 11  capital.loss    32561 non-null  int64
 12  hours.per.week  32561 non-null  int64
 13  native.country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [7]:
adult_data.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
0   90         ?   77053  ...             40   United-States  <=50K
1   82   Private  132870  ...             18   United-States  <=50K
2   66         ?  186061  ...             40   United-States  <=50K
3   54   Private  140359  ...             40   United-States  <=50K
4   41   Private  264663  ...             40   United-States  <=50K

[5 rows x 15 columns]

In [8]:
df1=adult_data[adult_data.workclass=="?"]

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1836 entries, 0 to 32544
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             1836 non-null   int64
 1   workclass       1836 non-null   object
 2   fnlwgt          1836 non-null   int64
 3   education       1836 non-null   object
 4   education.num   1836 non-null   int64
 5   marital.status  1836 non-null   object
 6   occupation      1836 non-null   object
 7   relationship    1836 non-null   object
 8   race            1836 non-null   object
 9   sex             1836 non-null   object
 10  capital.gain    1836 non-null   int64
 11  capital.loss    1836 non-null   int64
 12  hours.per.week  1836 non-null   int64
 13  native.country  1836 non-null   object
 14  income          1836 non-null   object
dtypes: int64(6), object(9)
memory usage: 229.5+ KB

In [10]:
adult_data=adult_data[adult_data["workclass"]!="?"]

In [11]:
adult_data.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
1   82   Private  132870  ...             18   United-States  <=50K
3   54   Private  140359  ...             40   United-States  <=50K
4   41   Private  264663  ...             40   United-States  <=50K
5   34   Private  216864  ...             45   United-States  <=50K
6   38   Private  150601  ...             40   United-States  <=50K

[5 rows x 15 columns]

In [12]:
df_categorical=adult_data.select_dtypes(include=["object"])
df_categorical.apply(lambda x:x=="?",axis=0).sum()

workclass           0
education           0
marital.status      0
occupation          7
relationship        0
race                0
sex                 0
native.country    556
income              0
dtype: int64

In [13]:
adult_data=adult_data[adult_data["native.country"]!="?"]
adult_data=adult_data[adult_data["occupation"]!="?"]

In [14]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30162 entries, 1 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30162 non-null  int64
 1   workclass       30162 non-null  object
 2   fnlwgt          30162 non-null  int64
 3   education       30162 non-null  object
 4   education.num   30162 non-null  int64
 5   marital.status  30162 non-null  object
 6   occupation      30162 non-null  object
 7   relationship    30162 non-null  object
 8   race            30162 non-null  object
 9   sex             30162 non-null  object
 10  capital.gain    30162 non-null  int64
 11  capital.loss    30162 non-null  int64
 12  hours.per.week  30162 non-null  int64
 13  native.country  30162 non-null  object
 14  income          30162 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [15]:
from sklearn import preprocessing
df_categorical=adult_data.select_dtypes(include=["object"])
df_categorical.head()

  workclass     education marital.status  ...     sex native.country income
1   Private       HS-grad        Widowed  ...  Female  United-States  <=50K
3   Private       7th-8th       Divorced  ...  Female  United-States  <=50K
4   Private  Some-college      Separated  ...  Female  United-States  <=50K
5   Private       HS-grad       Divorced  ...  Female  United-States  <=50K
6   Private          10th      Separated  ...    Male  United-States  <=50K

[5 rows x 9 columns]

In [16]:
le=preprocessing.LabelEncoder()
df_categorical=df_categorical.apply(le.fit_transform)
df_categorical.head()

   workclass  education  marital.status  ...  sex  native.country  income
1          2         11               6  ...    0              38       0
3          2          5               0  ...    0              38       0
4          2         15               5  ...    0              38       0
5          2         11               0  ...    0              38       0
6          2          0               5  ...    1              38       0

[5 rows x 9 columns]

In [17]:
adult_data=adult_data.drop(df_categorical,axis=1)
adult_data=pd.concat([adult_data,df_categorical],axis=1)
adult_data.head()

   age  fnlwgt  education.num  capital.gain  ...  race  sex  native.country  income
1   82  132870              9             0  ...     4    0              38       0
3   54  140359              4             0  ...     4    0              38       0
4   41  264663             10             0  ...     4    0              38       0
5   34  216864              9             0  ...     4    0              38       0
6   38  150601              6             0  ...     4    1              38       0

[5 rows x 15 columns]

In [18]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30162 entries, 1 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             30162 non-null  int64
 1   fnlwgt          30162 non-null  int64
 2   education.num   30162 non-null  int64
 3   capital.gain    30162 non-null  int64
 4   capital.loss    30162 non-null  int64
 5   hours.per.week  30162 non-null  int64
 6   workclass       30162 non-null  int64
 7   education       30162 non-null  int64
 8   marital.status  30162 non-null  int64
 9   occupation      30162 non-null  int64
 10  relationship    30162 non-null  int64
 11  race            30162 non-null  int64
 12  sex             30162 non-null  int64
 13  native.country  30162 non-null  int64
 14  income          30162 non-null  int64
dtypes: int64(15)
memory usage: 3.7 MB

In [19]:
adult_data["income"]=adult_data["income"].astype("category")

In [20]:
y=adult_data["income"]
x=adult_data.drop("income",axis=1)

In [21]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.30,random_state=99)

In [22]:
x_train.head()

       age  fnlwgt  education.num  ...  race  sex  native.country
24351   42  289636              9  ...     4    1              38
15626   37   52465              9  ...     4    1              38
4347    38  125933             14  ...     4    1              19
23972   44  183829             13  ...     4    0              38
26843   35  198841             11  ...     4    1              38

[5 rows x 14 columns]

In [23]:
from sklearn.tree import DecisionTreeClassifier
dt_default=DecisionTreeClassifier()
dt_default.fit(x_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [24]:
from sklearn.metrics import classification_report,confusion_matrix,accuracy_score
y_pred=dt_default.predict(x_test)
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.88      0.86      0.87      6867
           1       0.59      0.62      0.61      2182

    accuracy                           0.80      9049
   macro avg       0.73      0.74      0.74      9049
weighted avg       0.81      0.80      0.81      9049

In [25]:
print(confusion_matrix(y_test,y_pred))
print("accuracy=",accuracy_score(y_test,y_pred))

[[5930  937]
 [ 829 1353]]
accuracy= 0.8048403138468339